nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/usb_examples/usb_device_dfu/bm/dfu.c
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2017, 2019 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stdio.h>
#include <stdlib.h>
/*${standard_header_anchor}*/
#include "usb_device_config.h"
#include "usb.h"
#include "usb_device.h"

#include "usb_device_class.h"
#include "usb_device_dfu.h"
#include "usb_device_ch9.h"
#include "usb_device_descriptor.h"
#include "dfu.h"
#include "dfu_timer.h"
#include "usb_flash.h"
#include "fsl_device_registers.h"
#include "clock_config.h"
#include "fsl_debug_console.h"
#include "dfu_app.h"
#include "board.h"
/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define USB_DFU_CRC_INITIALIZED_VAULE (0xFFFFFFFFU)

typedef usb_status_t (*dfu_state_func)(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

static usb_status_t USB_DeviceDfuDetachReqest(uint16_t wTimeout);
static usb_status_t USB_DeviceDfuDownLoadReqest(uint16_t wLength, uint8_t **data);
static usb_status_t USB_DeviceDfuUpLoadReqest(uint32_t *length, uint8_t **data);
static usb_status_t USB_DeviceDfuGetStatusReqest(uint32_t *length, uint8_t **data);
static usb_status_t USB_DeviceDfuClearStatusReqest(void);
static usb_status_t USB_DeviceDfuGetStateReqest(uint32_t *length, uint8_t **data);
static usb_status_t USB_DeviceDfuAbortReqest(void);
static usb_status_t USB_DeviceStateAppIdle(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateAppDetach(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuIdle(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuDnLoadSync(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuDnBusy(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuDnLoadIdle(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuManifestSync(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuManifest(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuManifestWaitReset(usb_dfu_struct_t *dfu_dev,
                                                        usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuUpLoadIdle(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);
static usb_status_t USB_DeviceStateDfuError(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event);

/*******************************************************************************
 * Variables
 ******************************************************************************/
/* DFU state function table. */
const static dfu_state_func s_dfuStateFunc[11] = {
    USB_DeviceStateAppIdle,         USB_DeviceStateAppDetach,   USB_DeviceStateDfuIdle,
    USB_DeviceStateDfuDnLoadSync,   USB_DeviceStateDfuDnBusy,   USB_DeviceStateDfuDnLoadIdle,
    USB_DeviceStateDfuManifestSync, USB_DeviceStateDfuManifest, USB_DeviceStateDfuManifestWaitReset,
    USB_DeviceStateDfuUpLoadIdle,   USB_DeviceStateDfuError};

/* Instance of a DFU demo structure. */
static usb_dfu_struct_t s_UsbDeviceDfuDemo;
/* the buffer is used to store DFU downloaded data */
/*USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) uint8_t s_tempBuff[MAX_TRANSFER_SIZE];*/
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) uint8_t dfuFirmwareBlock[MAX_TRANSFER_SIZE];
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) usb_dfu_status_struct_t dfuStatus;
#if USB_DFU_BIT_CAN_UPLOAD
#define UPLOAD_SIZE (2 * MAX_TRANSFER_SIZE + 2)
USB_DMA_NONINIT_DATA_ALIGN(USB_DATA_ALIGN_SIZE) uint8_t updateLoadData[UPLOAD_SIZE];
#endif
uint8_t g_detachRequest;
/* DFU event queue. */
static dfu_queue_t s_DfuEventQueue;
/* Flag which indicates if it has sent a short frame in UPLOAD request. */
static uint8_t s_isShortFrame = 0U;
/* DFU CRC table list */
static uint32_t s_dfuCRCTableList[256];

uint32_t crcValue;
uint32_t address;
void static (*switchToApplicationMode)(void);
extern usb_device_dfu_app_struct_t g_UsbDeviceDfu;
/*******************************************************************************
 * Code
 ******************************************************************************/
/*!
 * @brief DFU CRC table creation function.
 *
 * This function creates the CRC table for CRC calculation.
 *
 * @return None.
 */

static void USB_DeviceDfuCreateCRCTableList(void)
{
    uint8_t i;
    uint16_t index;
    uint32_t topBit;
    uint32_t crcElement;
    /* CRC32 - polynomial reserved */
    uint32_t polynomial = 0xEDB88320U;

    for (index = 0U; index < 256U; index++)
    {
        crcElement = index;
        topBit     = 0x00000001U;
        for (i = 0U; i < 8U; i++)
        {
            if (crcElement & topBit)
            {
                crcElement = (crcElement >> 1U) ^ polynomial;
            }
            else
            {
                crcElement = (crcElement >> 1U);
            }
        }
        s_dfuCRCTableList[index] = crcElement;
    }
}

/*!
 * @brief DFU CRC calculation function.
 *
 * This function calculates the CRC over a buffer.
 *
 * @return CRC value.
 */
static uint32_t USB_DeviceDfuCalculateCRC(uint32_t crc, uint8_t *data, uint32_t length)
{
    uint8_t crcIndex   = 0U;
    uint32_t crcReturn = crc;
    uint32_t i;

    for (i = 0U; i < length; i++)
    {
        crcIndex  = (uint8_t)((crcReturn & 0x000000FFU) ^ data[i]);
        crcReturn = s_dfuCRCTableList[crcIndex] ^ (crcReturn >> 8U);
    }
    return (crcReturn);
}
/*!
 * @brief host cdc enter critical.
 *
 * This function is used to enter critical disable interrupt .
 *
 */
static void USB_DfuEnterCritical(uint8_t *sr)
{
    *sr = DisableGlobalIRQ();
#if !(defined(__DSC__) || defined(__CW__))
    __ASM("CPSID i");
#endif
}
/*!
 * @brief host cdc exit critical.
 *
 * This function is used to exit critical ,enable interrupt .
 *
 */
static void USB_DfuExitCritical(uint8_t sr)
{
    EnableGlobalIRQ(sr);
}
/*!
 * @brief Initialize the queue.
 *
 * @return Error code.
 */
static inline usb_status_t USB_DeviceDfuQueueInit(dfu_queue_t *q)
{
    usb_status_t error = kStatus_USB_Error;
    uint8_t usbOsaCurrentSr;
    USB_DfuEnterCritical(&usbOsaCurrentSr);
    (q)->head    = 0;
    (q)->tail    = 0;
    (q)->maxSize = DFU_EVENT_QUEUE_MAX;
    (q)->curSize = 0;
    (q)->mutex   = (osa_mutex_handle_t)(&(q)->mutexBuffer[0]);
    if (KOSA_StatusSuccess != OSA_MutexCreate(((q)->mutex)))
    {
        usb_echo("queue mutex create error!");
    }
    error = kStatus_USB_Success;
    USB_DfuExitCritical(usbOsaCurrentSr);
    return error;
}

/*!
 * @brief Delete the queue.
 *
 * @return Error code.
 */
/*
static inline usb_status_t USB_DeviceDfuQueueDelete(dfu_queue_t *q)
{
    usb_status_t error = kStatus_USB_Error;
    uint8_t usbOsaCurrentSr;
    USB_DfuEnterCritical(&usbOsaCurrentSr);
    (q)->head = 0;
    (q)->tail = 0;
    (q)->maxSize = 0;
    (q)->curSize = 0;
    error = kStatus_USB_Success;
    USB_DfuExitCritical(usbOsaCurrentSr);
    return error;
}
*/
/*!
 * @brief Check if the queue is empty.
 *
 * @return 1: queue is empty, 0: not empty.
 */
static inline uint8_t USB_DeviceDfuQueueIsEmpty(dfu_queue_t *q)
{
    return ((q)->curSize == 0) ? 1 : 0;
}

/*!
 * @brief Check if the queue is full.
 *
 * @return 1: queue is full, 0: not full.
 */
static inline uint8_t USB_DeviceDfuQueueIsFull(dfu_queue_t *q)
{
    return ((q)->curSize >= (q)->maxSize) ? 1 : 0;
}

/*!
 * @brief Get the size of the queue.
 *
 * @return Size of the quue.
 */
/*static inline uint32_t USB_DeviceDfuQueueSize(dfu_queue_t *q)
{
    return (q)->curSize;
}*/

/*!
 * @brief Put element into the queue.
 *
 * @return Error code.
 */
static inline usb_status_t USB_DeviceDfuQueuePut(dfu_queue_t *q, usb_device_dfu_event_struct_t *e)
{
    usb_status_t error = kStatus_USB_Error;
    uint8_t usbOsaCurrentSr;
    USB_DfuEnterCritical(&usbOsaCurrentSr);
    if (0 == USB_DeviceDfuQueueIsFull(q))
    {
        (q)->qArray[(q)->head++] = *(e);
        if ((q)->head == (q)->maxSize)
        {
            (q)->head = 0;
        }
        (q)->curSize++;
        error = kStatus_USB_Success;
    }
    USB_DfuExitCritical(usbOsaCurrentSr);
    return error;
}

/*!
 * @brief Get element from the queue.
 *
 * @return Error code.
 */
static inline usb_status_t USB_DeviceDfuQueueGet(dfu_queue_t *q, usb_device_dfu_event_struct_t *e)
{
    usb_status_t error = kStatus_USB_Error;
    uint8_t usbOsaCurrentSr;
    USB_DfuEnterCritical(&usbOsaCurrentSr);
    if (0 == USB_DeviceDfuQueueIsEmpty(q))
    {
        *(e) = (q)->qArray[(q)->tail++];
        if ((q)->tail == (q)->maxSize)
        {
            (q)->tail = 0;
        }
        (q)->curSize--;
        error = kStatus_USB_Success;
    }
    USB_DfuExitCritical(usbOsaCurrentSr);
    return error;
}

/*!
 * @brief DFU set state function.
 *
 * This function sets the state for a device.
 *
 * @return kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuSetState(usb_dfu_state_struct_t state)
{
    uint8_t usbOsaCurrentSr;
    USB_DfuEnterCritical(&usbOsaCurrentSr);
    s_UsbDeviceDfuDemo.dfuStatus->bState = state;
    USB_DfuExitCritical(usbOsaCurrentSr);
    return kStatus_USB_Success;
}

/*!
 * @brief DFU get state function.
 *
 * This function gets the state for a device.
 *
 * @return The state of the device.
 */
static usb_dfu_state_struct_t USB_DeviceDfuGetState(void)
{
    return (usb_dfu_state_struct_t)s_UsbDeviceDfuDemo.dfuStatus->bState;
}

/*!
 * @brief DFU set status function.
 *
 * This function sets the status for a device.
 *
 * @return kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuSetStatus(uint32_t status)
{
    uint8_t usbOsaCurrentSr;
    USB_DfuEnterCritical(&usbOsaCurrentSr);
    s_UsbDeviceDfuDemo.dfuStatus->bStatus = status;
    USB_DfuExitCritical(usbOsaCurrentSr);
    return kStatus_USB_Success;
}

/*!
 * @brief DFU get status function.
 *
 * This function gets the status for a device.
 *
 * @return The status of the device.
 */
static uint32_t USB_DeviceDfuGetStatus(void)
{
    return s_UsbDeviceDfuDemo.dfuStatus->bStatus;
}
#if (USB_DFU_BIT_WILL_DETACH)
#else
/*!
 * @brief DFU detach timeout routine.
 *
 * This function serves as the timeout routine for DETACH request.
 *
 * @return None.
 */
static void USB_DeviceDfuDetachTimeoutIsr(void)
{
    usb_status_t error = kStatus_USB_Success;
    usb_device_dfu_event_struct_t event;
    event.name    = kUSB_DeviceDfuEventDetachTimeout;
    event.wValue  = 0;
    event.wLength = 0;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
}
#endif
/*!
 * @brief DFU poll timeout routine.
 *
 * This function serves as the timeout routine for GET_STATUS request.
 *
 * @return None.
 */
static void USB_DeviceDfuPollTimeoutIsr(void)
{
    usb_status_t error = kStatus_USB_Success;
    usb_device_dfu_event_struct_t event;
    event.name    = kUSB_DeviceDfuEventPollTimeout;
    event.wValue  = 0;
    event.wLength = 0;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
}

/*!
 * @brief DFU DETACH request function.
 *
 * This function validates the request against the current state And informs the
 * state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuDetachReqest(uint16_t wTimeout)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;

    if (wTimeout > USB_DFU_DETACH_TIMEOUT)
    {
        /* wTimeout should not contain a value larger than the value specified in wDetachTimeout,
           or return kStatus_USB_InvalidRequest to stall endpoint. */
        return kStatus_USB_InvalidRequest;
    }

