nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/usb_examples/usb_device_dfu/bm/dfu.c
    state = USB_DeviceDfuGetState();
    if (kState_AppIdle != state)
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventDetachReq;
    event.wValue  = wTimeout;
    event.wLength = 0;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU DNLOAD request function.
 *
 * This function validates the request against the current state And informs the
 * state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */

static usb_status_t USB_DeviceDfuDownLoadReqest(uint16_t wLength, uint8_t **data)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;
    state = USB_DeviceDfuGetState();

    if (wLength > MAX_TRANSFER_SIZE)
    {
        wLength = MAX_TRANSFER_SIZE;
    }

    if ((kState_DfuIdle == state) || (kState_DfuDnLoadIdle == state))
    {
        if (USB_DFU_BIT_CAN_DNLOAD && (wLength > 0))
        {
            /* store the fimware block data */
            /*memcpy((void *)s_UsbDeviceDfuDemo.dfuFirmwareBlock, *data, wLength);*/
        }
        else if (0 == wLength)
        {
            status = USB_DeviceDfuGetStatus();

            if (USB_DFU_STATUS_ERR_NOT_DONE == status)
            {
                USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
            }
        }
        else
        {
            USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
        }
    }
    else
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventDnloadReq;
    event.wValue  = 0;
    event.wLength = wLength;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU UPLOAD request function.
 *
 * This function validates the request against the current state, assign the appropriate buffer
 * and length for the UPLOAD request.  And informs the state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuUpLoadReqest(uint32_t *length, uint8_t **data)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;
    uint32_t uploadLength;
    uint32_t i;

    uploadLength = *((uint32_t *)length);
    if (uploadLength > MAX_TRANSFER_SIZE)
    {
        /* The maximum length should not exceed the value specified in the wTransferSize field,
           or return kStatus_USB_InvalidRequest to stall endpoint. */
        return kStatus_USB_InvalidRequest;
    }

    state = USB_DeviceDfuGetState();
    if (kState_DfuIdle == state)
    {
#if USB_DFU_BIT_CAN_UPLOAD
        s_isShortFrame = 0U;

        /* get firmware start address from USB_DFU_APP_ADDRESS address */
        s_UsbDeviceDfuDemo.dfuFirmwareAddress = (uint32_t)&updateLoadData[0];
        /* get firmware size from USB_DFU_APP_ADDRESS + 4 address */
        s_UsbDeviceDfuDemo.dfuFirmwareSize = UPLOAD_SIZE;
        if ((0U == s_UsbDeviceDfuDemo.dfuFirmwareSize) || (NULL == s_UsbDeviceDfuDemo.dfuFirmwareAddress))
        {
            USB_DeviceDfuSetState(kState_DfuError);
            USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
            error = kStatus_USB_InvalidRequest;
        }
        else
        {
            usb_echo("\nUploading firmware ...\n");
            s_UsbDeviceDfuDemo.dfuStatus->bState      = kState_DfuUpLoadIdle;
            s_UsbDeviceDfuDemo.dfuCurrentUploadLenght = 0U;

            for (i = 0; i < uploadLength; i++)
            {
                s_UsbDeviceDfuDemo.dfuFirmwareBlock[i] = (((uint8_t *)s_UsbDeviceDfuDemo.dfuFirmwareAddress))[i];
            }
            s_UsbDeviceDfuDemo.dfuCurrentUploadLenght += uploadLength;
            *length = uploadLength;
            *data   = s_UsbDeviceDfuDemo.dfuFirmwareBlock;
        }
#else
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
#endif
    }
    else if (kState_DfuUpLoadIdle == state)
    {
        /* uploading indicator */
        usb_echo("&");
        if (s_UsbDeviceDfuDemo.dfuFirmwareSize - s_UsbDeviceDfuDemo.dfuCurrentUploadLenght >= uploadLength)
        {
            for (i = 0; i < uploadLength; i++)
            {
                s_UsbDeviceDfuDemo.dfuFirmwareBlock[i] =
                    (((uint8_t *)s_UsbDeviceDfuDemo.dfuFirmwareAddress) + s_UsbDeviceDfuDemo.dfuCurrentUploadLenght)[i];
            }
            s_UsbDeviceDfuDemo.dfuCurrentUploadLenght += uploadLength;
            *length = uploadLength;
            *data   = s_UsbDeviceDfuDemo.dfuFirmwareBlock;
        }
        else
        {
            usb_echo("\nUploading firmware completed.\n");
            *length = s_UsbDeviceDfuDemo.dfuFirmwareSize - s_UsbDeviceDfuDemo.dfuCurrentUploadLenght;
            for (i = 0; i < *length; i++)
            {
                s_UsbDeviceDfuDemo.dfuFirmwareBlock[i] =
                    (((uint8_t *)s_UsbDeviceDfuDemo.dfuFirmwareAddress) + s_UsbDeviceDfuDemo.dfuCurrentUploadLenght)[i];
            }
            s_UsbDeviceDfuDemo.dfuCurrentUploadLenght += *length;
            *data          = s_UsbDeviceDfuDemo.dfuFirmwareBlock;
            s_isShortFrame = 1U;
        }
    }
    else
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventUploadReq;
    event.wValue  = 0;
    event.wLength = *length;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU GET_STATUS request function.
 *
 * This function validates the request against the current state, sends the current status. And informs the
 * state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuGetStatusReqest(uint32_t *length, uint8_t **data)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;
    state = USB_DeviceDfuGetState();
    if ((kState_DfuDnBusy == state) || (kState_DfuManifest == state))
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    else
    {
        /* Device returns the status response */
        *data   = (uint8_t *)s_UsbDeviceDfuDemo.dfuStatus;
        *length = 6U;
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventGetStatusReq;
    event.wValue  = 0;
    event.wLength = *length;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU CLEAR_STATUS request function.
 *
 * This function validates the request against the current state. And informs the
 * state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuClearStatusReqest(void)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;
    state = USB_DeviceDfuGetState();
    if (kState_DfuError == state)
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_OK);
    }
    else
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventClearStatusReq;
    event.wValue  = 0;
    event.wLength = 0;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU GET_STATE request function.
 *
 * This function validates the request against the current state, sends the current
 * state. And informs the state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuGetStateReqest(uint32_t *length, uint8_t **data)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;
    state = USB_DeviceDfuGetState();
    if ((kState_DfuDnBusy == state) || (kState_DfuManifest == state))
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    else
    {
        /* Device returns the state response */
        *data   = (uint8_t *)&s_UsbDeviceDfuDemo.dfuStatus->bState;
        *length = 1U;
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventGetStateReq;
    event.wValue  = 0;
    event.wLength = *length;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU ABORT request function.
 *
 * This function validates the request against the current state. And informs the
 * state function via the event queue.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceDfuAbortReqest(void)
{
    usb_status_t error = kStatus_USB_Success;
    usb_dfu_state_struct_t state;
    usb_device_dfu_event_struct_t event;
    uint32_t status;
    state = USB_DeviceDfuGetState();
    if ((kState_DfuIdle == state) || (kState_DfuDnLoadIdle == state) || (kState_DfuUpLoadIdle == state))
    {
    }
    else
    {
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_STALLEDPKT);
    }
    status        = USB_DeviceDfuGetStatus();
    event.name    = kUSB_DeviceDfuEventAbortReq;
    event.wValue  = 0;
    event.wLength = 0;
    error         = USB_DeviceDfuQueuePut(&s_DfuEventQueue, &event);
    if (kStatus_USB_Success != error)
    {
        /* The queue is full, set the status to error unknown */
        USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
    }
    if (USB_DFU_STATUS_ERR_STALLEDPKT == status)
    {
        /* Stall the control pipe. */
        error = kStatus_USB_InvalidRequest;
    }
    else
    {
        error = kStatus_USB_Success;
    }
    return error;
}

/*!
 * @brief DFU class callback function.
 *
 * This function serves as the callback function for DFU class specific requests.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
usb_status_t USB_DeviceDfuDemoCallback(class_handle_t handle, uint32_t event, void *param)
{
    usb_status_t error                                  = kStatus_USB_InvalidRequest;
    usb_device_control_request_struct_t *controlRequest = (usb_device_control_request_struct_t *)param;
    switch (event)
    {
        case kUSB_DeviceDfuEventDetach:
            error = USB_DeviceDfuDetachReqest(controlRequest->setup->wValue);
            break;
        case kUSB_DeviceDfuEventDownLoad:
            if ((controlRequest->isSetup) && (controlRequest->setup->wLength > 0))
            {
                if (controlRequest->setup->wLength <= MAX_TRANSFER_SIZE)
                {
                    /* The maximum length should not exceed the value specified in the wTransferSize field,
                       or return kStatus_USB_InvalidRequest to stall endpoint. */
                    controlRequest->buffer = dfuFirmwareBlock;
                    controlRequest->length = controlRequest->setup->wLength;
                    error                  = kStatus_USB_Success;
                }
            }
            else
            {
                error = USB_DeviceDfuDownLoadReqest(controlRequest->setup->wLength, &controlRequest->buffer);
            }
            break;
        case kUSB_DeviceDfuEventUpLoad:
            error = USB_DeviceDfuUpLoadReqest(&controlRequest->length, &controlRequest->buffer);
            break;
        case kUSB_DeviceDfuEventGetStatus:
            error = USB_DeviceDfuGetStatusReqest(&controlRequest->length, &controlRequest->buffer);
            break;
        case kUSB_DeviceDfuEventClearStatus:
            error = USB_DeviceDfuClearStatusReqest();
            break;
        case kUSB_DeviceDfuEventGetState:
            error = USB_DeviceDfuGetStateReqest(&controlRequest->length, &controlRequest->buffer);
            break;
        case kUSB_DeviceDfuEventAbort:
            error = USB_DeviceDfuAbortReqest();
            break;
        default:
            break;
    }

    return error;
}

/*!
 * @brief DFU switch mode function.
 *
 * This function switches the device from DFU mode to APP mode.
 *
 * @return None.
 */
void USB_DeviceDfuSwitchMode(void)
{
#if defined(__DSC__) || defined(__CW__)
#if (defined(USB_DEVICE_CONFIG_RETURN_VALUE_CHECK) && (USB_DEVICE_CONFIG_RETURN_VALUE_CHECK > 0U))
    if (kStatus_USB_Success != USB_DeviceClassDeinit(CONTROLLER_ID))
    {
        usb_echo("device classs deinit error\r\n");
    }
#else
    (void)USB_DeviceClassDeinit(CONTROLLER_ID);
#endif
    __DI();
    SIM->PSWR3 = SIM_PSWR3_USB_OTG_MASK;
    SIM->PSWR2 = SIM_PSWR2_PIT0_MASK;
    SIM->PSWR3 = 0;
    SIM->PSWR2 = 0;
    address    = ((uint32_t)USB_DFU_APP_ADDRESS) >> 1U;
    INTC->VBA  = (address >> 8U);
    asm(move.l address, N);
    asm(jmp(N));
#else
    address = (uint32_t)(USB_DFU_APP_ADDRESS);

    static uint32_t newSP, newPC;
#if (defined(USB_DEVICE_CONFIG_RETURN_VALUE_CHECK) && (USB_DEVICE_CONFIG_RETURN_VALUE_CHECK > 0U))
    if (kStatus_USB_Success != USB_DeviceClassDeinit(CONTROLLER_ID))
    {
        usb_echo("device classs deinit error\r\n");
    }
#else
    (void)USB_DeviceClassDeinit(CONTROLLER_ID);
#endif
    SCB->VTOR = address;
    newSP     = ((uint32_t *)address)[0U];
    newPC     = ((uint32_t *)address)[1U];
    __set_CONTROL(0x00000000U);
    /* load new value to stack pointer and program counter */
    __set_MSP(newSP);
    switchToApplicationMode = (void (*)(void))newPC;
#if (0U != __CORTEX_M)
    /* reset FAULTMASK register */
    __set_FAULTMASK(0x00000000U);
#endif
    /* switch to application mode */
    switchToApplicationMode();
#endif
}
/*!
 * @brief DFU USB bus reset function.
 *
 * This function resets the USB bus by resetting the system.
 *
 * @return None.
 */
void USB_DeviceDfuBusReset(void)
{
    switch (s_UsbDeviceDfuDemo.dfuStatus->bState)
    {
        case kState_AppIdle:
            /* Do nothing */
            break;
        case kState_AppDetach:
            /* Enter DFU mode */
            USB_DeviceDfuSetState(kState_DfuIdle);

            /*g_detachRequest = 1U;*/
            /* Switch to DFU mode */
            /*NVIC_SystemReset();*/
            break;
        case kState_DfuIdle:
        case kState_DfuDnLoadSync:
        case kState_DfuDnBusy:
        case kState_DfuDnLoadIdle:
        case kState_DfuManifestSync:
        case kState_DfuManifest:
        case kState_DfuManifestWaitReset:
        case kState_DfuUpLoadIdle:
        case kState_DfuError:
            if (s_UsbDeviceDfuDemo.dfuIsDownloadingFinished)
            {
                s_UsbDeviceDfuDemo.dfuStatus->bState        = kState_AppIdle;
                s_UsbDeviceDfuDemo.dfuIsDownloadingFinished = 0U;
                /* switch to APP mode */
                /*NVIC_SystemReset();*/
            }
            else
            {
                if (USB_DFU_BLOCK_TRANSFER_UNDEFINED != s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus)
                {
                    /* The firmware is downloading to the device but the bus reset occurs, change
                       the state to Error */
                    s_UsbDeviceDfuDemo.dfuStatus->bState      = kState_DfuError;
                    s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus = USB_DFU_BLOCK_TRANSFER_UNDEFINED;
                }
                else
                {
                    /* the downloading is not started yet, there is no firmware is downloaded */
                    /* do nothing */
                }
            }
            break;
        default:
            break;
    }
}

/*!
 * @brief DFU demo initialization function.
 *
 * This function initializes the state of the device..
 *
 * @return None.
 */
void USB_DeviceDfuDemoInit(void)
{
    /* memmory status */
    usb_memmory_status_t memmoryStatus = kStatus_USB_MemmoryErrorUnknown;
    /* Default DFU status */
    s_UsbDeviceDfuDemo.dfuStatus                    = &dfuStatus;
    s_UsbDeviceDfuDemo.dfuStatus->bStatus           = USB_DFU_STATUS_OK;
    s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[0U] = 0x4U;
    s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[1U] = 0U;
    s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[2U] = 0U;

    USB_DeviceDfuSetState(kState_DfuIdle);

