nxp-mcuxpresso/mcux-sdk-examples/mimxrt685audevk/usb_examples/usb_device_dfu/bm/dfu.c
    s_UsbDeviceDfuDemo.dfuStatus->iString          = 0U;
    s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus      = USB_DFU_BLOCK_TRANSFER_UNDEFINED;
    s_UsbDeviceDfuDemo.dfuManifestationPhaseStatus = USB_DFU_MANIFEST_UNDEFINED;
    s_UsbDeviceDfuDemo.dfuFirmwareAddress          = USB_DFU_APP_ADDRESS;
    s_UsbDeviceDfuDemo.dfuFirmwareSize             = 0U;
    s_UsbDeviceDfuDemo.dfuIsTheFirstBlock          = 0U;
    s_UsbDeviceDfuDemo.dfuCRC                      = USB_DFU_CRC_INITIALIZED_VAULE;
    s_UsbDeviceDfuDemo.dfuFirmwareBlock            = &dfuFirmwareBlock[0];

    g_detachRequest = 0U;
    USB_DeviceDfuQueueInit(&s_DfuEventQueue);

    USB_DeviceDfuCreateCRCTableList();

    memmoryStatus = USB_MemmoryInit();
    if (kStatus_USB_MemmoryErrorSecure == memmoryStatus)
    {
        s_UsbDeviceDfuDemo.dfuStatus->bStatus = USB_DFU_STATUS_ERR_WRITE;
    }
    else if (kStatus_USB_MemmoryErrorUnknown == memmoryStatus)
    {
        s_UsbDeviceDfuDemo.dfuStatus->bStatus = USB_DFU_STATUS_ERR_UNKNOWN;
    }
    else
    {
    }
#if USB_DFU_BIT_CAN_UPLOAD
    uint32_t *temp;
    temp = (uint32_t *)&updateLoadData[0];
    for (uint32_t i = 0; i < (UPLOAD_SIZE / 4 - 2); i++)
    {
        temp[i] = i;
    }
#endif
    DFU_TimerInit();
}

/*!
 * @brief DFU manifest function.
 *
 * This function does manifestation operation in MANIFEST state.
 *
 * @return None.
 */

static void USB_DeviceDfuManifest(void)
{
    uint32_t remainingLen;
    uint8_t *startAddress;
    uint32_t wLength;
    uint32_t readLen;

    /*do some thing to manifest*/
    /* store the fimware block data */
    if (USB_DFU_MANIFEST_IN_PROGRESS == s_UsbDeviceDfuDemo.dfuManifestationPhaseStatus)
    {
        crcValue     = 0;
        remainingLen = s_UsbDeviceDfuDemo.dfuFirmwareSize - 4;
#if defined(__DSC__) || defined(__CW__)
        startAddress = (uint8_t *)(USB_DFU_APP_ADDRESS_DATA_MEMORY_MAP * 2);
#else
        startAddress = (uint8_t *)USB_DFU_APP_ADDRESS;
#endif

        s_UsbDeviceDfuDemo.dfuCRC = USB_DFU_CRC_INITIALIZED_VAULE;
        wLength                   = MAX_TRANSFER_SIZE;
        readLen                   = 0;
        if (remainingLen < MAX_TRANSFER_SIZE)
        {
            wLength = remainingLen;
        }
        while (remainingLen)
        {
            memcpy((void *)s_UsbDeviceDfuDemo.dfuFirmwareBlock, (uint8_t *)(startAddress + readLen), wLength);
            readLen += wLength;
            /* calculate DFU CRC */
            s_UsbDeviceDfuDemo.dfuCRC = USB_DeviceDfuCalculateCRC(
                s_UsbDeviceDfuDemo.dfuCRC, (uint8_t *)&s_UsbDeviceDfuDemo.dfuFirmwareBlock[0], wLength);
            remainingLen -= wLength;
            if (remainingLen < MAX_TRANSFER_SIZE)
            {
                wLength = remainingLen;
            }
        }
        memcpy((void *)&crcValue, (uint8_t *)(startAddress + s_UsbDeviceDfuDemo.dfuFirmwareSize - 4), 4);

        s_UsbDeviceDfuDemo.crcCheck = 0;
        if (s_UsbDeviceDfuDemo.dfuCRC != crcValue)
        {
            usb_echo("crc check error\r\n");
        }
        else
        {
            usb_echo("crc check ok\r\n");
            s_UsbDeviceDfuDemo.crcCheck = 1;
        }

        s_UsbDeviceDfuDemo.dfuManifestationPhaseStatus = USB_DFU_MANIFEST_COMPLETE;
    }
}

/*!
 * @brief DFU download function.
 *
 * This function does download operation in DNLOAD state.
 *
 * @return None.
 */

static void USB_DeviceDfuDnload(void)
{
    uint8_t usbOsaCurrentSr;

    if (USB_DFU_BLOCK_TRANSFER_IN_PROGRESS == s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus)
    {
        usb_memmory_status_t memmoryStatus = kStatus_USB_MemmoryErrorUnknown;
        uint32_t firmwareAddress           = USB_DFU_APP_ADDRESS + s_UsbDeviceDfuDemo.dfuFirmwareSize;
        if (s_UsbDeviceDfuDemo.dfuIsTheFirstBlock)
        {
            /* Erase application region */

            uint8_t usbOsaCurrentSr;

            USB_DfuEnterCritical(&usbOsaCurrentSr);
            memmoryStatus = USB_MemmoryErase((uint32_t)USB_DFU_APP_ADDRESS, USB_DFU_APP_SIZE);

            USB_DfuExitCritical(usbOsaCurrentSr);
            if (kStatus_USB_MemmoryErrorErase == memmoryStatus)
            {
                s_UsbDeviceDfuDemo.dfuStatus->bStatus = USB_DFU_STATUS_ERR_ERASE;
            }
            else if (kStatus_USB_MemmoryErrorEraseVerify == memmoryStatus)
            {
                s_UsbDeviceDfuDemo.dfuStatus->bStatus = USB_DFU_STATUS_ERR_CHECK_ERASED;
            }
            else if (kStatus_USB_MemmoryErrorUnknown == memmoryStatus)
            {
                s_UsbDeviceDfuDemo.dfuStatus->bStatus = USB_DFU_STATUS_ERR_UNKNOWN;
            }
            else
            {
            }
            s_UsbDeviceDfuDemo.dfuIsTheFirstBlock = 0U;
        }
        if (s_UsbDeviceDfuDemo.dfuFirmwareBlockLength > 0U)
        {
            s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus = USB_DFU_BLOCK_TRANSFER_UNDEFINED;
            /* Update the firmware size */
            s_UsbDeviceDfuDemo.dfuFirmwareSize += s_UsbDeviceDfuDemo.dfuFirmwareBlockLength;
            /* firmware memmorying */

            USB_DfuEnterCritical(&usbOsaCurrentSr);

            memmoryStatus = USB_MemmoryProgram(firmwareAddress, (uint8_t *)&s_UsbDeviceDfuDemo.dfuFirmwareBlock[0],
                                               s_UsbDeviceDfuDemo.dfuFirmwareBlockLength);
            USB_DfuExitCritical(usbOsaCurrentSr);

            if (kStatus_USB_MemmorySuccess == memmoryStatus)
            {
                s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus = USB_DFU_BLOCK_TRANSFER_COMPLETE;
            }
            else if (memmoryStatus == kStatus_USB_MemmoryErrorProgram)
            {
                USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_PROG);
            }
            else if (memmoryStatus == kStatus_USB_MemmoryErrorProgramAddress)
            {
                USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_ADDRESS);
            }
            else if (memmoryStatus == kStatus_USB_MemmoryErrorProgramVerify)
            {
                USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_VERIFY);
            }
            else if (memmoryStatus == kStatus_USB_MemmoryErrorUnknown)
            {
                USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
            }
            else
            {
            }
        }
    }
}

/*!
 * @brief DFU APP_IDLE state function.
 *
 * This function validates the event against the current state. And sets
 * the next state of the device.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceStateAppIdle(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event)
{
    usb_status_t error = kStatus_USB_Success;
    int i;

    if (NULL != event)
    {
        switch (event->name)
        {
            case kUSB_DeviceDfuEventDetachReq:
                USB_DeviceDfuDemoInit();
#if USB_DFU_BIT_WILL_DETACH
                g_detachRequest = 1U;
                /* Device generates a detach-attach sequence on the bus */
                USB_DeviceStop(g_UsbDeviceDfu.deviceHandle);
                for (i = 0; i < 5000; i++)
                {
#if defined(__DSC__) || defined(__CW__)
                    asm(NOP);
#else
                    __ASM("nop");
#endif
                }
                /*Add one delay here to make the DP pull down long enough to allow host to detect the previous
                 * disconnection.*/
                SDK_DelayAtLeastUs(5000, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
                USB_DeviceRun(g_UsbDeviceDfu.deviceHandle);
#else
                g_detachRequest = 1U;
                if (event->wValue > USB_DFU_DETACH_TIMEOUT)
                {
                    USB_DeviceDfuSetStatus(USB_DFU_STATUS_ERR_UNKNOWN);
                    error = kStatus_USB_InvalidParameter;
                }
                else
                {
                    dfu_timer_object_t dfuTimerObject;
                    dfuTimerObject.timerCount     = event->wValue;
                    dfuTimerObject.timerCallback  = (dfu_timer_callback)USB_DeviceDfuDetachTimeoutIsr;
                    s_UsbDeviceDfuDemo.dfuTimerId = DFU_AddTimerQueue(&dfuTimerObject);
                }
#endif
                USB_DeviceDfuSetState(kState_AppDetach);
                break;
            case kUSB_DeviceDfuEventGetStatusReq:
                USB_DeviceDfuSetState(kState_AppIdle);
                break;
            case kUSB_DeviceDfuEventGetStateReq:
                USB_DeviceDfuSetState(kState_AppIdle);
                break;
            default:
                USB_DeviceDfuSetState(kState_AppIdle);
                break;
        }
    }
    return error;
}

/*!
 * @brief DFU APP_DETACH state function.
 *
 * This function validates the event against the current state. And sets
 * the next state of the device.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceStateAppDetach(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event)
{
    usb_status_t error = kStatus_USB_Success;

    if (NULL != event)
    {
        switch (event->name)
        {
            case kUSB_DeviceDfuEventGetStatusReq:
                USB_DeviceDfuSetState(kState_AppDetach);
                break;
            case kUSB_DeviceDfuEventGetStateReq:
                USB_DeviceDfuSetState(kState_AppDetach);
                break;
            case kUSB_DeviceDfuEventDetachReq:
            case kUSB_DeviceDfuEventDnloadReq:
            case kUSB_DeviceDfuEventAbortReq:
            case kUSB_DeviceDfuEventUploadReq:

                USB_DeviceDfuSetState(kState_AppIdle);
                break;
            case kUSB_DeviceDfuEventDetachTimeout:
            default:
                USB_DeviceDfuSetState(kState_AppIdle);
                break;
        }
    }
    return error;
}

/*!
 * @brief DFU IDLE state function.
 *
 * This function validates the event against the current state. And sets
 * the next state of the device.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceStateDfuIdle(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event)
{
    usb_status_t error = kStatus_USB_Success;

    if (NULL != event)
    {
        switch (event->name)
        {
            case kUSB_DeviceDfuEventDnloadReq:
                if ((event->wLength > 0) && USB_DFU_BIT_CAN_DNLOAD)
                {
                    /* update firmware block length */
                    s_UsbDeviceDfuDemo.dfuFirmwareBlockLength = event->wLength;
                    /* update firmware block status */
                    s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus = USB_DFU_BLOCK_TRANSFER_IN_PROGRESS;
                    /* update firmware size */
                    s_UsbDeviceDfuDemo.dfuFirmwareSize = 0U;
                    /* update current download length */
                    s_UsbDeviceDfuDemo.dfuIsTheFirstBlock = 1U;
                    /* reset the downloading flag */
                    s_UsbDeviceDfuDemo.dfuIsDownloadingFinished = 0U;
                    /* reset manifestation phase flag */
                    s_UsbDeviceDfuDemo.dfuManifestationPhaseStatus = USB_DFU_MANIFEST_UNDEFINED;
                    /* this time (5000 ms) is used to erase all the APP code region */
                    /* and memmory the first firmware block data */
                    s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[0] = 2 & 0xFF;
                    s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[1] = (2 >> 8) & 0xFF;
                    s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[2] = (2 >> 16) & 0xFF;

                    USB_DeviceDfuSetState(kState_DfuDnLoadSync);
                }
                else
                {
                    USB_DeviceDfuSetState(kState_DfuError);
                }

                break;
            case kUSB_DeviceDfuEventUploadReq:
                if (USB_DFU_BIT_CAN_UPLOAD)
                {
                    USB_DeviceDfuSetState(kState_DfuUpLoadIdle);
                }
                else
                {
                    USB_DeviceDfuSetState(kState_DfuError);
                }

                break;
            case kUSB_DeviceDfuEventAbortReq:
            case kUSB_DeviceDfuEventGetStatusReq:
            case kUSB_DeviceDfuEventGetStateReq:
                USB_DeviceDfuSetState(kState_DfuIdle);
                break;
            case kUSB_DeviceDfuEventDetachReq:
                USB_DeviceDfuSetState(kState_DfuIdle);
                break;
            default:
                USB_DeviceDfuSetState(kState_DfuError);
                break;
        }
    }
    return error;
}

/*!
 * @brief DFU DNLOAD_SYNC state function.
 *
 * This function validates the event against the current state. And sets
 * the next state of the device.
 *
 * @return A USB error code or kStatus_USB_Success.
 */
static usb_status_t USB_DeviceStateDfuDnLoadSync(usb_dfu_struct_t *dfu_dev, usb_device_dfu_event_struct_t *event)
{
    usb_status_t error = kStatus_USB_Success;
    dfu_timer_object_t dfuTimerObject;

    if (NULL != event)
    {
        switch (event->name)
        {
            case kUSB_DeviceDfuEventGetStatusReq:
                if (USB_DFU_BLOCK_TRANSFER_IN_PROGRESS == s_UsbDeviceDfuDemo.dfuFirmwareBlockStatus)
                {
                    dfuTimerObject.timerCount = (uint32_t)(
                        (uint32_t)(0xFFFFFF & ((uint32_t)s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[2] << 16U)) +
                        (uint32_t)(0xFFFF & ((uint32_t)s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[1] << 8U)) +
                        (uint32_t)(0xFF & (uint32_t)s_UsbDeviceDfuDemo.dfuStatus->bwPollTimeout[0]));
                    dfuTimerObject.timerCount = (dfuTimerObject.timerCount >> 1);

